-- -- 青龙象征东方和春天,代表生机和活力,颜色上以绿色和青色为主
return {
	bg = "#1f2326", -- 深绿色，代表森林的背景
	fg = "#a0e6e6", -- 蓝青色, 主题文本色
	-- fg = "#6b8da8", -- 蓝青色, 主题文本色
	-- fg = "#d1f1fa", -- 浅青色，代表生机和活力的文本颜色

	subtext1 = "#8cd9b3", -- 淡青绿色，用于次要文本 (函数名/类名/变量名)
	subtext2 = "#70ba9f", -- 中青绿色，用于次级文本 (方法名/属性名/次要的变量)
	subtext3 = "#568a8a", -- 深青绿色，用于更次级的文本 (参数名/局部变量/类型注释/)
	subtext4 = "#4d7a7a", -- 灰青色，最次要的文本，注释等 (注释/文档字符串/行号)
	bg_dark = "#0f1f1f", -- 更深的背景色，增强对比度

	black = "#0a1a1a", -- 深黑绿色，用于高对比元素
	red = "#ff6b6b", -- 亮红色
	green = "#95ba8c", -- 浅绿色，象征生命和自然，对比色
	yellow = "#fffacd", -- 浅黄色，提供视觉焦点
	purple = "#dda0dd", -- 浅紫色，增加神秘感和对比
	magenta = "#ff69b4", -- 浅紫红色，强调
	orange = "#ffa07a", -- 浅橙色，增加温暖感
	blue = "#87cefa", -- 浅蓝色，冷静和对比
	cyan = "#e0ffff", -- 浅青色，冷静和稳定

	bright_black = "#1c3636", -- 较亮的深黑绿色，用于对比
	bright_red = "#ff7f7f", -- 更亮的红色，强调力量和热情
	bright_green = "#2fb11f", -- 更亮的绿色，活力和生命
	bright_yellow = "#ffeb8e", -- 更亮的黄色，视觉焦点
	bright_purple = "#c3b2ff", -- 更亮的紫色，神秘和梦幻
	bright_magenta = "#ffa4d1", -- 更亮的红紫色，强调
	bright_orange = "#ffc17e", -- 更亮的橙色，温暖和活力
	bright_blue = "#82d4ff", -- 更亮的蓝色，冷静和对比
	bright_cyan = "#7ffff1", -- 更亮的青色，冷静和稳定

	gray0 = "#3a3a3a", -- 比较亮的深灰色，背景补充
	gray1 = "#4f4f4f", -- 中灰色，背景补充
	gray2 = "#646464", -- 较浅的灰色，背景补充
	gray3 = "#797979", -- 更浅的灰色，背景补充
	gray4 = "#8e8e8e", -- 最浅的灰色，背景补充

	none = "NONE",
}
