-- 玄武象征北方和冬天,代表坚韧和保护,颜色上以黑色和深蓝色为主,带有一些绿色和银色的点缀,以体现其沉稳和力量
return {
	bg = "#0b0f13", -- 深蓝黑色，代表夜晚的背景
	fg = "#e0e6ed", -- 浅蓝灰色，提供良好的对比
	subtext1 = "#c1c9d1", -- 淡蓝灰色，用于次要文本
	subtext2 = "#a2b1b9", -- 中蓝灰色，用于次级文本
	subtext3 = "#84989f", -- 深蓝灰色，用于更次级的文本
	subtext4 = "#667f85", -- 更深的蓝灰色，用于最次要的文本
	bg_dark = "#0a0c10", -- 更深的背景色，增强对比度
	black = "#101820", -- 深黑色，用于高对比元素
	red = "#ff5c5c", -- 亮红色，象征力量和热情
	green = "#77c77d", -- 浅绿色，象征生命和对比色
	yellow = "#ffc658", -- 亮黄色，提供视觉焦点
	purple = "#a09be7", -- 浅紫色，增加神秘感和对比
	magenta = "#ff77a9", -- 亮紫红色，强调
	orange = "#ff9e60", -- 亮橙色，增加温暖感
	blue = "#5e9cff", -- 浅蓝色，冷静和对比
	cyan = "#5ed6c6", -- 浅青色，冷静和稳定
	bright_black = "#202830", -- 较亮的深黑色，用于对比
	bright_red = "#ff7676", -- 更亮的红色，强调力量和热情
	bright_green = "#8ae78d", -- 更亮的绿色，活力和生命
	bright_yellow = "#ffdb8e", -- 更亮的黄色，视觉焦点
	bright_purple = "#c3afff", -- 更亮的紫色，神秘和梦幻
	bright_magenta = "#ff95c1", -- 更亮的红紫色，强调
	bright_orange = "#ffc27e", -- 更亮的橙色，温暖和活力
	bright_blue = "#82c1ff", -- 更亮的蓝色，冷静和对比
	bright_cyan = "#7feff1", -- 更亮的青色，冷静和稳定
	gray0 = "#2e3a45", -- 比较亮的深灰蓝色，背景补充
	gray1 = "#3b4854", -- 中灰蓝色，背景补充
	gray2 = "#485562", -- 较浅的灰蓝色，背景补充
	gray3 = "#556370", -- 更浅的灰蓝色，背景补充
	gray4 = "#62707d", -- 最浅的灰蓝色，背景补充
	-- Special
	none = "NONE",
}
